Revit 2027 API
ParameterTypeId.PlacementRight Property
 "Right"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PlacementRight { get; }
Public Shared ReadOnly Property PlacementRight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PlacementRight {
	ForgeTypeId^ get ();
}
static member PlacementRight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace